jupyter/experiments/random/outputs/false_N200000_D50_K32.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 15
number of transactions actually processed: 75/75
latency average = 371.767 ms
initial connection time = 17.659 ms
tps = 13.449299 (without initial connection time)
statement latencies in milliseconds:
         0.019  \set id random(1, 200000)
       371.001  SELECT *