jupyter/experiments/random/outputs/true_N2m_D25_K64.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 10
number of transactions actually processed: 50/50
latency average = 55.606 ms
initial connection time = 14.019 ms
tps = 89.918192 (without initial connection time)
statement latencies in milliseconds:
         0.027  \SET id random(1, 10000)
        54.585  SELECT *