jupyter/experiments/random/outputs/true_N800000_D50_K32.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 15
number of transactions actually processed: 75/75
latency average = 1260.255 ms
initial connection time = 15.678 ms
tps = 3.967450 (without initial connection time)
statement latencies in milliseconds:
         0.025  \set id random(1, 800000)
      1195.025  SELECT *